function c=ask2(n,t)%δημιουργία της function c
%για να τρέξουν οι πράξεις αρχικά πριν την tic; ask1(n); toc; γράφουμε στο
%command window n=(1:1000)
ask2ab=sum(1./n.^2)+sum(1./2.^n)%εδώ γίνεται η πράξη για να βρούμε το άθροισμα της πρώτης και της δεύτερης συνάρτησης μαζί
ask2ac=sum(1./n.^2)+sum((-1).^n+1./n)%εδώ γίνεται η πράξη για να βρούμε το άθροισμα της πρώτης και της τρίτης συνάρτησης μαζί
ask2bc=sum(1./2.^n)+sum((-1).^n+1./n)%εδώ γίνεται η πράξη για να βρούμε το άθροισμα της δεύτερης και της τρίτης συνάρτησης μαζί
figure%δημιουργία της figure για την απεικόνιση των συναρτήσεων σε σχεδιαγράμμτα
x=[t,ask2ab]%το t είναι το βήμα όπου το έχουμε ορίσει με t=[-20:0.1:20]και το ask2ab είναι η γραφική παράσταση.
subplot(3,1,1)%διάσταση του σχεδιαγράμματος 
plot(x)%απεικόνιση του χ όπου είναι η ευθεία
title('subplot 1')%τίτλος του πρώτου σχεδιαγράμματος
y=[t,ask2ac]%το t είναι το βήμα όπου το έχουμε ορίσει με t=[-20:0.1:20]και το ask2ac είναι η γραφική παράσταση.
subplot(3,1,2)%διάσταση του σχεδιαγράμματος 
plot(y)%απεικόνιση του y όπου είναι η ευθεία
title('subplot 2')%τίτλος του δεύτερου σχεδιαγράμματος
k=[t,ask2bc]%το t είναι το βήμα όπου το έχουμε ορίσει με t=[-20:0.1:20]και το ask2bc είναι η γραφική παράσταση.
subplot(3,1,3)%διάσταση του σχεδιαγράμματος 
plot(k)%απεικόνιση του κ όπου είναι η ευθεία
title('subplot 3')%τίτλος του τρίτου σχεδιαγράμματος
end%Τέλος της function
%το t είναι το βήμα όπου το έχουμε ορίσει με t=[-20:0.1:20]

