function  fibonacci=ask3(n)%δημιουργία της function fibonacci
zero=0;%ορίζουμε την πρώτη μεταβλητή zero ως μηδέν
one=1;%ορίζουμε την δεύτερη μεταβλητή one ως ένα
e=[1:1:n+1];%είναι πίνακας που ξεκινά από το 1 με βήμα 1 μέχρι n+1
for c=0:1:n%για c με βήμα 1 μέχρι n όπου n είναι αυτό που δίνουμε 
if(c<=1)%ελέγχουμε αν c μικρότερο ή ίσο του 1
fibonacci=c;%τότε η συνάρτηση fibonacci είναι ίσο με το c
else%αλλιώς     
fibonacci=zero+one;%η fibonnaci θα είναι ίσο με το άθροισμα της πρώτης και της δεύτερης μεταβλητής
zero=one;%τότε η πρώτη μεταβλητή γίνεται δεύτερη
one=fibonacci;%και η δεύτερη μεταβλητή γίνεται η fibonacci
end%τέλος του ελέγχου
e(c+1)=fibonacci;%εκτυπώνει το μέγεθος του πίνακα των στοιχείων του fibonacci 
end%τέλος της επανάλληψης μεγέθους πίνακα
for c=1:1:n%για c με βήμα 1 μέχρι n 
fibonacci(c)=e(c);%εκτυπώνει τους αριθμούς της συνάρτησης fibonacci
end%τέλος επανάληψης εκτύπωσης του πίνακα 
end%τέλος συνάρτησης